app/controllers/books_controller.rb

def index
    if params[:search]
      @books = Book.search(params[:search]).paginate(page: params[:page], per_page: 4)
    else
       @books = Book.paginate(page: params[:page], per_page: 10)
---
SELECT "books".* FROM "books" WHERE (title like '%potop%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "books" WHERE (title like '%m%')
SELECT "books".* FROM "books" LIMIT 10 OFFSET 0

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "cover", "created_at", "isbn", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "d"], ["cover", "untitled.png"], ["created_at", Fri, 21 Mar 2014 08:07:14 UTC +00:00], ["isbn", ""], ["title", ""], ["updated_at", Fri, 21 Mar 2014 08:07:14 UTC +00:00]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "cover" = ?, "updated_at" = ? WHERE "books"."id" = 1  [["cover", "untitled.png"], ["updated_at", Mon, 24 Mar 2014 12:14:05 UTC +00:00]]